name: "resnet_model_fp16"
platform: "onnxruntime_onnx"
max_batch_size: 10


input [
  {
    name: "input"
    data_type: TYPE_FP16
    dims: [ 3, 224, 224 ]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP16
    dims: [ 2 ]
  }
]

instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]
